export const FORM_ERRORS = {
  defaultError: 'Введены некорректные значения',
  notValidEmail: 'Поле "Email" обязательно для заполнения и должно содержать корректный email-адрес.',
  notValidPassword: 'Поле "Пароль" обязательно для заполнения. Пароль может содержать символы A-Z в верхнем или нижнем регистре, цифры и спецсиволы: !@#$%&*_+=` . Количество символов в пароле от 8 до 50.',
  notValidName: 'Поле "Имя" обязательно для заполнения. Имя может содержать символы А-Я, A-Z в верхнем или нижнем регистре. Количество символов от 2 до 30.',
};

export const SIGNIN_FORM_ERRORS = {
  signinFieldsError: 'Почта и пароль обязательны для заполнения и должны быть корректно заполнены.',
};
