export const FORM_ERRORS = {
  defaultError: 'Введены некорректные значения',
  notValidEmail: 'Поле обязательно для заполнения и должно содержать корректный email-адрес.',
  notValidPassword: 'Поле обязательно для заполнения и может содержать символы: A-Za-z, 0-9, !@#$%&*_+=` (от 8 до 50).',
  notValidName: 'Поле обязательно для заполнения и может содержать символы: А-Яа-я, A-Za-z (от 2 до 30).',
};

export const SIGNIN_FORM_ERRORS = {
  signinFieldsError: 'Почта и пароль обязательны для заполнения и должны быть корректно заполнены.',
};
